Revit 2024 API
BuiltInFailures.ConnectorFailures.NetworkValidityError Property
 The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NetworkValidityError { get; }
Visual Basic
Public Shared ReadOnly Property NetworkValidityError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NetworkValidityError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace